In [1]:
import pandas as pd

In [11]:
bikes = pd.read_csv('bikes.csv', parse_dates=['starttime', 'stoptime'])

In [4]:
bikes.head()

,trip_id,usertype,gender,starttime,stoptime,tripduration,from_station_name,latitude_start,longitude_start,dpcapacity_start,to_station_name,latitude_end,longitude_end,dpcapacity_end,temperature,visibility,wind_speed,precipitation,events
0,7147,Subscriber,Male,2013-06-28 19:01:00,2013-06-28 19:17:00,993,Lake Shore Dr & Monroe St,41.881050,-87.616970,11.0,Michigan Ave & Oak St,41.900960,-87.623777,15.0,73.9,10.0,12.7,-9999.0,mostlycloudy
1,7524,Subscriber,Male,2013-06-28 22:53:00,2013-06-28 23:03:00,623,Clinton St & Washington Blvd,41.883380,-87.641170,31.0,Wells St & Walton St,41.899930,-87.634430,19.0,69.1,10.0,6.9,-9999.0,partlycloudy
2,10927,Subscriber,Male,2013-06-30 14:43:00,2013-06-30 15:01:00,1040,Sheffield Ave & Kingsbury St,41.909592,-87.653497,15.0,Dearborn St & Monroe St,41.881320,-87.629521,23.0,73.0,10.0,16.1,-9999.0,mostlycloudy
3,12907,Subscriber,Male,2013-07-01 10:05:00,2013-07-01 10:16:00,667,Carpenter St & Huron St,41.894556,-87.653449,19.0,Clark St & Randolph St,41.884576,-87.631890,31.0,72.0,10.0,16.1,-9999.0,mostlycloudy
4,13168,Subscriber,Male,2013-07-01 11:16:00,2013-07-01 11:18:00,130,Damen Ave & Pierce Ave,41.909396,-87.677692,19.0,Damen Ave & Pierce Ave,41.909396,-87.677692,19.0,73.0,10.0,17.3,-9999.0,partlycloudy

In [12]:
start = bikes['starttime']

What percentage of bike rides happen in January?

In [17]:
start[start.dt.month == 1].count()/start.count()

0.027191598953862126

In [18]:
start.dt.month_name().value_counts(normalize=True).round(3)

August       0.137
July         0.132
September    0.130
June         0.121
October      0.111
May          0.086
November     0.071
April        0.064
December     0.045
March        0.044
February     0.030
January      0.027
Name: starttime, dtype: float64

What percentage of bike rides happen on the weekend?

In [27]:
start.dt.dayofweek.value_counts(normalize=True).loc[5:6].sum().round(3)

0.197

In [28]:
start.dt.weekday.isin([5, 6]).mean()

0.19692946555131866

What percentage of bike rides happen on the last day of the month?

In [30]:
start.dt.is_month_end.mean()

0.031563816406795904

We would expect that the value of the minutes recorded for each starting ride is approximately random.
Can you show some data that confirms or rejects this?

In [31]:
start.dt.minute.value_counts(normalize=True)

12    0.017968
6     0.017928
8     0.017868
18    0.017808
43    0.017629
21    0.017549
10    0.017529
48    0.017509
44    0.017449
15    0.017409
53    0.017349
17    0.017329
37    0.017309
13    0.017289
19    0.017269
33    0.017229
42    0.017229
39    0.017189
24    0.017189
22    0.017110
34    0.017070
29    0.017070
45    0.016950
5     0.016890
36    0.016870
11    0.016870
14    0.016870
49    0.016850
47    0.016830
30    0.016810
16    0.016710
32    0.016670
38    0.016630
1     0.016630
40    0.016531
7     0.016491
2     0.016471
46    0.016471
4     0.016391
23    0.016331
54    0.016311
57    0.016291
3     0.016251
28    0.016091
35    0.016071
59    0.016071
56    0.016031
0     0.015932
58    0.015912
50    0.015872
31    0.015872
55    0.015852
9     0.015812
27    0.015812
41    0.015712
20    0.015612
25    0.015512
52    0.015253
51    0.015213
26    0.014973
Name: starttime, dtype: float64

Assign the length of the ride to ride_length. Then find the percentage of rides that lasted longer than 30
minutes.

In [32]:
ride_length = bikes['stoptime'] - start

In [42]:
(ride_length.dt.seconds > 1800).mean()

0.019625067380063487

In [47]:
stocks = pd.read_csv('stocks10.csv', index_col='date',parse_dates=['date'])
stocks.head(3)

             MSFT  AAPL    SLB   AMZN  TSLA    XOM    WMT      T  FB   V
date
1999-10-25  29.84  2.32  17.02  82.75   NaN  21.45  38.99  16.78 NaN NaN
1999-10-26  29.82  2.34  16.65  81.25   NaN  20.89  37.11  17.28 NaN NaN
1999-10-27  29.33  2.38  16.52  75.94   NaN  20.80  36.94  18.27 NaN NaN

In [48]:
aapl = stocks['AAPL']
aapl.head()

date
1999-10-25    2.32
1999-10-26    2.34
1999-10-27    2.38
1999-10-28    2.43
1999-10-29    2.50
Name: AAPL, dtype: float64

Use one line of code to find the daily percentage returns of AAPL and drop any missing values. Save the
result to aapl_change.

In [67]:
close_change = aapl.pct_change().dropna()
close_change.head()

date
1999-10-26    0.008621
1999-10-27    0.017094
1999-10-28    0.021008
1999-10-29    0.028807
1999-11-01   -0.032000
Name: AAPL, dtype: float64

Find the mean daily return for Apple, the first and last closing prices, and the number of trading days.
Store all four of these values into separate variables.

In [69]:
mean_apple = close_change.mean()
mean_apple

0.0012692984527780723

In [63]:
first_apple = aapl.iloc[0]
first_apple

2.32

In [64]:
last_apple = aapl.iloc[-1]
last_apple

242.46

In [65]:
size_apple = aapl.size
size_apple

5033

If Apple returned its mean percentage return every single day since the first day you have data, what would
its last closing price be? Is it the same as the actual last closing price? You need to use all the variables
calculated from Exercise 2.

In [70]:
first_apple * (mean_apple + 1) ** size_apple

1374.5687797657017

In [71]:
last_apple

242.46

Find the z-score for the Apple daily returns. Save this to a variable z_score_raw. What is the max and
minimum score?

In [72]:
mean = close_change.mean()
std = close_change.std()

In [73]:
z_score_raw = (close_change - mean) / std

In [74]:
z_score_raw.max()

5.3712520859138

In [75]:
z_score_raw.min()

-20.221564477921486

What percentage did Apple’s stock increase when it had its highest maximum raw z-score?

In [77]:
close_change[z_score_raw == z_score_raw.max()]

date
2008-10-13    0.139188
Name: AAPL, dtype: float64

Create a function that accepts a Series of stock closing prices. Have it return the percentage of prices within
1, 2, and 3 standard deviations from the mean. Use your function to return results for different stocks found
in the stocks DataFrame.

In [78]:
def stocks_123dev(data):
    close_change = data.pct_change().dropna()
    mean = close_change.mean()
    std = close_change.std()
    z_score_abs = ((close_change - mean) / std).abs()
    pct_within1 = round((z_score_abs < 1).mean(), 3)
    pct_within2 = round((z_score_abs < 2).mean(), 3)
    pct_within3 = round((z_score_abs < 3).mean(), 3)
    return pct_within1, pct_within2, pct_within3

In [81]:
print(stocks_123dev(stocks['AMZN']))

(0.833, 0.95, 0.98)

How many days did Apple close above 100 and below 120?

In [95]:
aapl[(aapl>100) & (aapl<120)].count()

401

How many days did Apple close below 50 or above 150?

In [96]:
aapl[(aapl>150) | (aapl<50)].count()

3596

Look up the definition for interquartile range and select all Apple closing prices that are within this range.
There are multiple ways to do this. Check the quantile method.

In [100]:
q1 = aapl.quantile(.25)
q3 = aapl.quantile(.75)
criteria = (aapl >= q1) & (aapl <= q3)
aapl[criteria].head()

date
2000-03-01    4.06
2000-03-03    3.99
2000-03-06    3.92
2000-03-10    3.92
2000-03-21    4.21
Name: AAPL, dtype: float64

Find the date of the highest closing price. Find out how many trading days it has been since Apple recorded
it highest closing price.

In [110]:
aapl.loc[aapl.idxmax():,].count()

2

In [112]:
movie = pd.read_csv('movie.csv', index_col='title')
cols = ['actor1_fb', 'actor2_fb', 'actor3_fb']
actor_fb = movie[cols]
actor_fb.head(3)

                                          actor1_fb  actor2_fb  actor3_fb
title
Avatar                                       1000.0      936.0      855.0
Pirates of the Caribbean: At World's End    40000.0     5000.0     1000.0
Spectre                                     11000.0      393.0      161.0

Calculate the mean of each actor Facebook like column. Which actor (1, 2, or 3) has the highest mean?

In [113]:
actor_fb.mean()

actor1_fb    6494.488491
actor2_fb    1621.923516
actor3_fb     631.276313
dtype: float64

The result of exercise 1 is a Series of three values. Can you call a method on this Series to choose the column
name with the highest mean Facebook likes

In [115]:
actor_fb.mean().idxmax()

'actor1_fb'

Calculate the total Facebook likes of all three actors for each movie

In [117]:
actor_fb.sum(axis=1).head()

title
Avatar                                         2791.0
Pirates of the Caribbean: At World's End      46000.0
Spectre                                       11554.0
The Dark Knight Rises                         73000.0
Star Wars: Episode VII - The Force Awakens      143.0
dtype: float64

What percentage of movies have more than 10,000 total actor FB likes?

In [121]:
actor_fb.sum(axis=1)[actor_fb.sum(axis=1)>10000].count()/len(actor_fb)

0.2982099267697315

Find the median gross revenue in millions of dollars for the movies that have more than 10,000 total actor
FB likes. Do the same for movies with 10,000 or less total actor FB likes

In [126]:
movie[actor_fb.sum(axis=1)>10000]['gross'].median()/1e6

42.3919155

In [127]:
movie[actor_fb.sum(axis=1)<10000]['gross'].median()/1e6

16.8

From exercise 5, it appears that movies with more than 10,000 total actor FB likes gross 2.5 times as much.
This may be due to the fact that newer movies have more actors that are recognized by FB users. Find the
median year produced for both groups

In [128]:
movie.columns

Index(['year', 'color', 'content_rating', 'duration', 'director_name',
       'director_fb', 'actor1', 'actor1_fb', 'actor2', 'actor2_fb', 'actor3',
       'actor3_fb', 'gross', 'genres', 'num_reviews', 'num_voted_users',
       'plot_keywords', 'language', 'country', 'budget', 'imdb_score'],
      dtype='object')

In [129]:
movie[actor_fb.sum(axis=1)>10000]['year'].median()

2006.0

In [130]:
movie[actor_fb.sum(axis=1)<10000]['year'].median()

2005.0

For each movie made in the year 2016, what is the median of the total actor FB likes?

In [140]:
movie.query('year==2016')[cols].sum(axis=1).median()

3571.5

Write a function that has a single parameter, year. Have it return the median of the total actor FB likes
for the given year. Test your function with the year 2016 and verify the result with Exercise 6.

In [141]:
def year_fb(year):
    year = year
    cols = ['actor1_fb', 'actor2_fb', 'actor3_fb']
    return movie.query('year==@year')[cols].sum(axis=1).median()

In [142]:
print(year_fb(2016))

3571.5

Write a loop to print out the year and median total actor FB likes for that year from 1990 to 2016

In [143]:
for i in range(1990,2017):
    print(year_fb(i))

2017.0
2436.0
2147.5
2018.0
2368.5
2612.0
2692.5
1964.0
2482.0
2595.0
2378.0
2424.0
2146.0
2019.0
2298.0
2072.0
2359.0
2002.5
2400.0
2145.0
2411.0
2818.5
2426.0
2420.0
2084.0
2063.0
3571.5

In [2]:
college = pd.read_csv('college.csv', index_col='instnm')
college.head(3)

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
instnm,,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370

Find the number of non-missing values in each column and again for each row

In [151]:
college.count(axis=1)

instnm
Alabama A & M University                                  26
University of Alabama at Birmingham                       26
Amridge University                                        24
University of Alabama in Huntsville                       26
Alabama State University                                  26
                                                          ..
SAE Institute of Technology  San Francisco                 5
Rasmussen College - Overland Park                          5
National Personal Training Institute of Cleveland          5
Bay Area Medical Academy - San Jose Satellite Location     5
Excel Learning Center-San Antonio South                    5
Length: 7535, dtype: int64

In [153]:
college.count().head()

city         7535
stabbr       7535
hbcu         7164
menonly      7164
womenonly    7164
dtype: int64

What is the average number of non-missing values for each row?

In [154]:
college.count(axis=1).mean()

22.70763105507631

The ugds column of the college dataset contains the total undergraduate population. What is the least
number of colleges it would take to have have a total of more than 5 million students?

In [155]:
ugds_cumsum = college['ugds'].sort_values(ascending=False).cumsum()

In [156]:
(ugds_cumsum < 5000000).sum() + 1

185

Call the describe method, but make it work only for the string columns.

In [158]:
college.describe(include='object')

            city stabbr    md_earn_wne_p10 grad_debt_mdn_supp
count       7535   7535               6413               7503
unique      2514     59                598               2038
top     New York     CA  PrivacySuppressed  PrivacySuppressed
freq          87    773                822               1510

Call the max method, but only return columns that are numeric

In [159]:
college.max(numeric_only=True)

hbcu                 1.0000
menonly              1.0000
womenonly            1.0000
relaffil             1.0000
satvrmid           765.0000
satmtmid           785.0000
distanceonly         1.0000
ugds            151558.0000
ugds_white           1.0000
ugds_black           1.0000
ugds_hisp            1.0000
ugds_asian           0.9727
ugds_aian            1.0000
ugds_nhpi            0.9983
ugds_2mor            0.5333
ugds_nra             0.9286
ugds_unkn            0.9027
pptug_ef             1.0000
curroper             1.0000
pctpell              1.0000
pctfloan             1.0000
ug25abv              1.0000
dtype: float64

Find the number of missing values for each row.

In [162]:
college.isna().sum(axis=1).head()

instnm
Alabama A & M University               0
University of Alabama at Birmingham    0
Amridge University                     2
University of Alabama in Huntsville    0
Alabama State University               0
dtype: int64

What percentage of rows have more than 5 missing values?

In [168]:
len(college[college.isna().sum(axis=1)>5])/ len(college)

0.09011280690112806

How many total missing values are there in the entire DataFrame?

In [179]:
college.isna().sum(axis=1).sum()

24808

How many total non-missing values are there in the entire DataFrame?

In [174]:
college.count().sum()

171102

How many rows will be dropped when the dropna method is called with its defaults. Calculate this number
without calling the dropna method.

In [183]:
(college.isna().sum(axis=1) > 0).sum()

6364

Verify the result from exercise 5 by calling the dropna method.

In [182]:
college.shape[0] - college.dropna().shape[0]

6364

Drop all the rows that are missing the ugds column.

In [186]:
college.dropna(subset=['ugds']).head()

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
instnm,,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

Drop all columns that have more than 5% of their values missing

In [192]:
thresh = int(.95 * len(college))

In [194]:
college.dropna(thresh=thresh,axis=1).shape

(7535, 9)

Fill in the missing values with the maximum value of each column.

In [198]:
college_max = college.max()

In [199]:
college.fillna(college_max).head()

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
instnm,,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
Amridge University,Montgomery,AL,0.0,0.0,0.0,1,765.0,785.0,1.0,291.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [200]:
emp = pd.read_csv('employee.csv')
emp.head(3)

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black

Sort department, race, sex ascending along with salary descending.

In [202]:
emp.sort_values(by=['dept', 'race', 'sex', 'salary'], ascending=[True, True, True, False]).head()

,dept,title,hire_date,salary,sex,race
19946,Fire,"PHYSICIAN,MD",2015-06-22,342784.0,Female,Asian
514,Fire,ASSISTANT EMS PHYSICIAN DIRECTOR,2017-08-28,141669.0,Female,Asian
8642,Fire,STAFF PSYCHOLOGIST,2014-12-22,103805.0,Female,Asian
7199,Fire,SENIOR STAFF ANALYST,2003-01-14,97850.0,Female,Asian
430,Fire,ADMINISTRATIVE ASSISTANT,1985-08-19,55432.0,Female,Asian

How many unique combinations of department and title exist?

In [205]:
len(emp.drop_duplicates(subset=['dept', 'title']))

1312

Since only Series methods have a unique method, can you think of a creative way of getting the same result
as exercise 2 with the unique method?

In [215]:
len((emp['dept'] + emp['title']).unique())

1312

Find the frequency of occurrence of all race and sex combinations using the trick from exercise 3. For
instance, you would return an object that contains the number of ‘Hispanic Males’, ‘Black Females’, etc…

In [218]:
(emp['sex'] + '-' + emp['race']).value_counts()

Male-White                6488
Male-Black                5074
Male-Hispanic             4208
Female-Black              3587
Female-Hispanic           1940
Female-White              1291
Male-Asian                1059
Female-Asian               488
Male-Native American       107
Female-Native American      39
dtype: int64

Select the columns stabbr, satvrmid, satmtmid and ugds columns for the state of Texas (‘TX’) that have
an undergraduate student population of more than 20,000. Drop any rows with missing values and assign
the result to the variable name college_tx

In [224]:
college.head()

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
instnm,,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [237]:
cols = ['stabbr','satvrmid','satmtmid','ugds']
college_tx = college[cols].query('stabbr == "TX" and ugds > 20000').dropna()
college_tx

                                       stabbr  satvrmid  satmtmid     ugds
instnm
University of Houston                      TX     555.0     590.0  31643.0
University of North Texas                  TX     545.0     555.0  29758.0
Texas State University                     TX     510.0     515.0  32177.0
Texas A & M University-College Station     TX     580.0     615.0  46941.0
The University of Texas at Arlington       TX     494.0     550.0  29616.0
The University of Texas at Austin          TX     630.0     660.0  38914.0
The University of Texas at San Antonio     TX     505.0     535.0  23815.0
Texas Tech University                      TX     540.0     560.0  28278.0

Rank each column from the college_tx DataFrame from greatest to least.

In [238]:
college_tx.rank(ascending=False)

                                        stabbr  satvrmid  satmtmid  ugds
instnm
University of Houston                      4.5       3.0       3.0   4.0
University of North Texas                  4.5       4.0       5.0   5.0
Texas State University                     4.5       6.0       8.0   3.0
Texas A & M University-College Station     4.5       2.0       2.0   1.0
The University of Texas at Arlington       4.5       8.0       6.0   6.0
The University of Texas at Austin          4.5       1.0       1.0   2.0
The University of Texas at San Antonio     4.5       7.0       7.0   8.0
Texas Tech University                      4.5       5.0       4.0   7.0

Using the full college dataset, find the largest school by population for each state. Return only the stabbr
and ugds columns sorting by ugds.

In [239]:
college.head()

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
instnm,,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [243]:
college.sort_values('ugds', ascending=False) \
.drop_duplicates(subset='stabbr')[['stabbr', 'ugds']].head(10)

                                   stabbr      ugds
instnm
University of Phoenix-Arizona          AZ  151558.0
Ivy Tech Community College             IN   77657.0
Miami Dade College                     FL   61470.0
Lone Star College System               TX   59920.0
Liberty University                     VA   49340.0
American Public University System      WV   44924.0
Ashford University                     CA   44744.0
Western Governors University           UT   44499.0
Ohio State University-Main Campus      OH   43733.0
Kaplan University-Davenport Campus     IA   40335.0

Several of the columns from the college dataset contain binary data (are either 0 or 1). Can you identify
the names of these columns?

In [247]:
college.nunique()

city                  2514
stabbr                  59
hbcu                     2
menonly                  2
womenonly                2
relaffil                 2
satvrmid               163
satmtmid               167
distanceonly             2
ugds                  2932
ugds_white            4397
ugds_black            3242
ugds_hisp             2809
ugds_asian            1254
ugds_aian              601
ugds_nhpi              363
ugds_2mor              957
ugds_nra               920
ugds_unkn             1517
pptug_ef              3420
curroper                 2
pctpell               4422
pctfloan              4155
ug25abv               4285
md_earn_wne_p10        598
grad_debt_mdn_supp    2038
dtype: int64

In [251]:
n=0
for i in range(0,11):
    n += 6 ** i
    print(n)

1
7
43
259
1555
9331
55987
335923
2015539
12093235
72559411

Create a new boolean column in the college_all DataFrame named ‘Verbal Higher’ that is True for every
college that has a higher verbal than math SAT score. Find the mean of this new column. Why does this
number look suspiciously low?

In [5]:
college.columns

Index(['city', 'stabbr', 'hbcu', 'menonly', 'womenonly', 'relaffil',
       'satvrmid', 'satmtmid', 'distanceonly', 'ugds', 'ugds_white',
       'ugds_black', 'ugds_hisp', 'ugds_asian', 'ugds_aian', 'ugds_nhpi',
       'ugds_2mor', 'ugds_nra', 'ugds_unkn', 'pptug_ef', 'curroper', 'pctpell',
       'pctfloan', 'ug25abv', 'md_earn_wne_p10', 'grad_debt_mdn_supp'],
      dtype='object')

In [7]:
college['Verbal_Higher'] = college['satvrmid'] > college['satmtmid']

In [9]:
college['Verbal_Higher'].mean()

0.048042468480424684

Find the real percentage of schools with higher verbal than math SAT scores.

In [11]:
cols = ['satvrmid', 'satmtmid']
sat = college[cols].dropna()

In [14]:
(sat['satvrmid'] > sat['satmtmid']).mean()

0.30574324324324326

Create a new column called ‘median all’ that has every value set to the median population of all the schools

In [15]:
college['median_all'] = college['ugds'].median()

Rename the row label ‘Texas A & M University-College Station’ to ‘TAMU’. Reassign the result back to
college_all and then select this row as a Series.

In [16]:
college = college.rename(index={'Texas A & M University-College Station':'TAMU'})
college.loc['TAMU']

city                  College Station
stabbr                             TX
hbcu                                0
menonly                             0
womenonly                           0
relaffil                            0
satvrmid                          580
satmtmid                          615
distanceonly                        0
ugds                            46941
ugds_white                      0.661
ugds_black                     0.0278
ugds_hisp                      0.2068
ugds_asian                     0.0546
ugds_aian                      0.0028
ugds_nhpi                       0.001
ugds_2mor                      0.0308
ugds_nra                       0.0131
ugds_unkn                      0.0022
pptug_ef                       0.1049
curroper                            1
pctpell                        0.2183
pctfloan                        0.332
ug25abv                        0.0308
md_earn_wne_p10                 53900
grad_debt_mdn_supp              19000
Verbal_Higher                   False
median_all                      412.5
Name: TAMU, dtype: object

In [23]:
emp = pd.read_csv('employee.csv')
emp.head(3)

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black

Create a new column named bonus and insert it right after the salary column equal. Have its value equal
to 10% of the salary. Round the bonus to the nearest thousand

In [24]:
emp.insert(4, 'bonus', (emp['salary']*0.1).round(-3))
emp.head()

,dept,title,hire_date,salary,bonus,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,9000.0,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,8000.0,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,5000.0,Male,Black
3,Police,SENIOR POLICE OFFICER,1997-05-27,75942.10,8000.0,Male,Hispanic
4,Police,SENIOR POLICE OFFICER,2006-01-23,69355.26,7000.0,Male,White
...,...,...,...,...,...,...,...
24303,Police,SENIOR POLICE OFFICER,2001-12-03,75942.10,8000.0,Male,Black
24304,Other,SENIOR PROCUREMENT SPECIALIST,2016-03-28,76175.00,8000.0,Female,Black
24305,Houston Public Works,WATER SERVICE INSPECTOR I,2015-09-14,35173.00,4000.0,Male,Black
24306,Health & Human Services,HUMAN SERVICE PROGRAM MANAGER,2008-05-19,67198.00,7000.0,Female,Black
24307,Police,POLICE SERGEANT,1984-05-29,NaN,NaN,Male,White

Find the relative frequency of departments for all employees and then find the relative frequency of departments for the top 100 salaries. Compare the differences.

In [25]:
dept_freq = emp['dept'].value_counts(normalize=True)
dept_freq.round(2)

Police                     0.31
Fire                       0.18
Houston Public Works       0.17
Other                      0.14
Health & Human Services    0.06
Houston Airport System     0.05
Parks & Recreation         0.05
Library                    0.02
Solid Waste Management     0.02
Name: dept, dtype: float64

In [26]:
emp_top100 = emp.nlargest(100, 'salary')
emp_top100.head()

      dept         title   hire_date    salary    bonus   sex   race
1732  Fire  PHYSICIAN,MD  2014-09-27  342784.0  34000.0  Male  White
1975  Fire  PHYSICIAN,MD  2014-09-27  342784.0  34000.0  Male  Asian
4680  Fire  PHYSICIAN,MD  2015-11-23  342784.0  34000.0  Male  White
4882  Fire  PHYSICIAN,MD  2017-01-09  342784.0  34000.0  Male  White
6501  Fire  PHYSICIAN,MD  2016-05-31  342784.0  34000.0  Male  White

In [28]:
emp_freq = emp_top100['dept'].value_counts(normalize=True)
emp_freq

Other                      0.36
Fire                       0.22
Police                     0.15
Houston Airport System     0.09
Houston Public Works       0.09
Health & Human Services    0.07
Solid Waste Management     0.01
Library                    0.01
Name: dept, dtype: float64

In [29]:
dept_freq-emp_freq

Fire                      -0.039977
Health & Human Services   -0.014339
Houston Airport System    -0.039975
Houston Public Works       0.082371
Library                    0.013161
Other                     -0.221239
Parks & Recreation              NaN
Police                     0.161544
Solid Waste Management     0.011063
Name: dept, dtype: float64

Find the day that each stock had its largest percentage one-day drop in price.

In [30]:
stocks = pd.read_csv('stocks10.csv', index_col='date', parse_dates=['date'])
stocks.head(3)

             MSFT  AAPL    SLB   AMZN  TSLA    XOM    WMT      T  FB   V
date
1999-10-25  29.84  2.32  17.02  82.75   NaN  21.45  38.99  16.78 NaN NaN
1999-10-26  29.82  2.34  16.65  81.25   NaN  20.89  37.11  17.28 NaN NaN
1999-10-27  29.33  2.38  16.52  75.94   NaN  20.80  36.94  18.27 NaN NaN

In [31]:
stocks.pct_change().idxmin()

MSFT   2000-04-24
AAPL   2000-09-29
SLB    2008-10-15
AMZN   2001-07-24
TSLA   2012-01-13
XOM    2008-10-15
WMT    2018-02-20
T      2000-12-19
FB     2018-07-26
V      2008-10-15
dtype: datetime64[ns]